{
  "applications": {
    "title": "Applications",
    "desc": "Web developer specialized in React, Next.js and TypeScript, I design high-performance and user-centered applications. From technical architecture to interface design, I master the entire front-end development cycle. My approach combines technical rigor, performance optimization and attention to UX details. Trained in fullstack (Ruby on Rails, PostgreSQL), I understand back-end challenges and collaborate effectively with technical teams to deliver complete and scalable web solutions.",
    "github": "My GitHub account",
    "techstack": "My tech stack"
  },

  "projects": {
    "actions": {
      "code": "Code",
      "preview": "Preview",
      "demo": "Demo"
    },
    "lifoAI": {
      "title": "LIFO.AI",
      "desc": "Frontend developer at Lifo.AI, startup specialized in AI-powered inventory management. Design and development of the application with Next.js, TypeScript and Tailwind CSS: marketing pages, dashboard with advanced filters and OCR scan, multilingual system, performance optimization. Implementation of technical infrastructure (Jest tests, analytics, GDPR) and complete quality assurance. The application uses machine learning algorithms to optimize stock levels, forecast demand and automate procurement decisions."
    },
    "sportify": {
      "title": "SPORTIFY",
      "desc": "Sportify is a PWA built with Ruby on Rails, PostgreSQL, and Javascript with AJAX to connect users with sports partners by browsing or creating local events. We designed it in Figma, used Bootstrap for the UI, and deployed it on Heroku with a custom domain. The project was then presented in front of a big crowd."
    },
    "gis": {
      "title": "GIS PROJECT",
      "desc": "This project is a web GIS application that allows users to visualize and interact with geospatial data. It was built using React, Leaflet, and Mapbox, and it includes features such as map layers, markers, and popups. The application is designed to be user-friendly and responsive."
    },
    "carbonSavings": {
      "title": "CARBON SAVINGS SIMULATOR",
      "desc": "The Carbon Savings Simulator is a web app that shows what you save by biking instead of using a car or public transportation. It calculates carbon emissions, money saved, and calories burned, with graph visualizations for easy insights. Built with React, Tailwind CSS, and the Mapbox API, it's user-friendly and responsive."
    },
    "portfolio": {
      "title": "PORTFOLIO",
      "desc": "This portfolio was developed with Next.js, TypeScript and Tailwind. Integrates a dark mode, next Intl for language support, animations with Framer Motion, advanced SEO optimization and deployed on Vercel. Showcases my projects and services in a modern and responsive interface with optimal performance."
    },
    "tymouet": {
      "title": "TY MOUET",
      "desc": "Ty Mouet was our first project at Le Wagon, a seagull-themed Airbnb clone built with Ruby on Rails, PostgreSQL, and AJAX. We handled a many-to-many database, deployed on Heroku, and worked in an agile team. Key features included booking logic, user authentication, and geolocation-based dynamic search."
    },
    "movieWatchlist": {
      "title": "MOVIES WATCHLIST",
      "desc": "The Movies Watchlist is a React and Redux application that helps users discover and organize movies using TMDB's database. Features include real-time search, categorized browsing, and a personal watchlist with ratings and comments. Built with Tailwind CSS and includes local storage for persistence."
    }
  }
}
