{
  "navbar": {
    "home": "Inicio",
    "applications": "Aplicaciones",
    "photos": "Fotos",
    "books": "Libros",
    "contact": "Contacto",
    "wedding": "Boda",
    "mosaic": "Mosaico",
    "sport": "Deporte",
    "cityscape": "Ciudad",
    "landscape": "Paisaje",
    "civilisation": "Civilisation",
    "wizzyenasie": "Wizzy en Asia",
    "descriptions": {
      "wedding": "Descubre mis fotos de boda",
      "mosaic": "Colección de fotos en mosaico",
      "sport": "Fotos de deportes y eventos",
      "cityscape": "Paisajes urbanos y rascacielos",
      "landscape": "Paisajes naturales y montañas",
      "civilisation": "Mi libro sobre la película Civilisation",
      "wizzyenasie": "Mi libro de mis aventuras en Asia"
    }
  },
  "landing": {
    "title": "Félix Orain",
    "profession": "Desarrollador y fotógrafo "
  },
  "portfolio": {
    "title": "Mi portafolio",
    "intro": "Después de cuatro años como fotógrafo freelance, me aventuré en el desarrollo web para combinar mi visión artística con la tecnología, creando experiencias digitales únicas. \n ¡Explora mis proyectos y descubre en qué he estado trabajando!"
  },
  "about": {
    "title": "Sobre mí",
    "desc": "Soy un desarrollador web creativo con una sólida experiencia en fotografía y diseño. Durante años, he explorado formas de dar vida a las ideas a través de imágenes y narrativas, perfeccionando mi ojo para los detalles y la estética. \n\n Ahora, canalizo esa pasión en la creación de experiencias digitales intuitivas y accesibles. Actualmente estoy ampliando mis habilidades aprendiendo Ruby on Rails y React, deseoso de combinar mi experiencia creativa con nuevas competencias técnicas para diseñar productos útiles y atractivos.",
    "resume": "Mi currículum"
  },
  "readMore": "Leer más",
  "seeMore": {
    "webdev": {
      "text": "Ver todos mis proyectos",
      "ariaLabel": "Ver todos mis proyectos de desarrollo web"
    },
    "photography": {
      "text": "Ver todas mis fotos",
      "ariaLabel": "Ver todas mis fotos"
    },
    "books": {
      "text": "Ver mis publicaciones",
      "ariaLabel": "Ver todos mis libros y revistas"
    }
  },
  "contact": {
    "title": "Contáctame",
    "text": "No dudes en contactarme para cualquier proyecto en: felix.orain@gmail.com",
    "name": "Tu nombre",
    "email": "Tu correo electrónico",
    "message": "Tu mensaje",
    "send": "Enviar mensaje"
  },
  "notFound": {
    "title": "404 - Página no encontrada",
    "subtitle": "Es posible que te hayas perdido, vuelve a la página principal:",
    "back": "Volver al inicio"
  },
  "footer": {
    "copyright": "Copyright Félix Orain © Todos los derechos reservados.",
    "madeby": "Desarrollado con ❤️ por Félix Orain"
  },
  "webdev": {
    "title": "Desarrollo web",
    "desc": "Me gradué de Le Wagon y construí aplicaciones reales desde cero, adquiriendo experiencia práctica en desarrollo web. Con una experiencia en fotografía, aporto un fuerte sentido del diseño, ahora combinado con sólidas habilidades de programación.",
    "sportify": "SPORTIFY",
    "tymouet": "TY MOUET",
    "portfolio": "PORTAFOLIO"
  },
  "design": {
    "title": "Diseño",
    "desc": "Creé dos libros que documentan cinco meses de aventura en el sudeste asiático, utilizando mis propias fotos y textos. Autoeditados y vendidos en más de 500 copias, esta experiencia me enseñó la consistencia en el diseño y cómo gestionar proyectos a gran escala."
  },
  "photographysection": {
    "title": "Fotografía",
    "desc": "Desde pequeño, siempre me ha fascinado el arte y la aventura. Quería satisfacer esta profunda necesidad de aventura y poder contar esas historias a mi manera. Cuando descubrí la fotografía hace unos años, se abrió un mundo completamente nuevo para mí."
  },
  "photospage": {
    "title": "Fotografía",
    "desc": "Desde pequeño, siempre me ha fascinado el arte y la aventura. Quería satisfacer esta profunda necesidad de aventura y poder contar esas historias a mi manera. Cuando descubrí la fotografía hace unos años, se abrió un mundo completamente nuevo para mí.",
    "sport": "Deporte",
    "mosaic": "Mosaico",
    "cityscape": "Ciudad",
    "landscape": "Paisaje",
    "wedding": "Boda"
  },
  "sportphotopage": {
    "title": "Deportes",
    "desc": "Descubrir la fotografía de acción me pareció la forma perfecta de capturar movimiento, emoción y narrativa. Fotografiar parkour, escalada o siluetas en vastos entornos me permitió mostrar tanto el dinamismo humano como la escala del mundo que nos rodea. Cada toma congelaba un momento de energía, donde el movimiento se encontraba con la quietud de la naturaleza o la arquitectura. A través de esto, aprendí a abrazar la imprevisibilidad del movimiento y el desafío del tiempo, capturando no solo la acción sino también la historia del esfuerzo, la libertad y nuestra conexión con el mundo. Este estilo de fotografía me enseñó a ver el movimiento y el significado en la relación entre los humanos y su entorno."
  },
  "mosaicphotopage": {
    "title": "Mosaicos",
    "desc": "Me encanta capturar patrones en fotografía porque revelan belleza en la simplicidad y la repetición. Ya sea en la naturaleza o en la arquitectura, los patrones crean ritmo y armonía que atraen la mirada. Fotografiar estos detalles, como las ondulaciones en el agua, las fachadas de azulejos o las sombras simétricas, es como descubrir arte oculto en lo cotidiano. Los patrones cuentan historias de diseño, estructura y equilibrio, ofreciendo un sentido de orden en un mundo caótico. A través de mi lente, busco celebrar estos visuales hipnotizantes e invitar a otros a ver el mundo de manera diferente."
  },
  "landscapephotopage": {
    "title": "Paisajes",
    "desc": "Como fotógrafo, me encantan los paisajes por su capacidad de evocar tanto quietud como asombro. Capturar las nubes que se deslizan por los acantilados y valles de Yosemite se siente como preservar las obras maestras efímeras de la naturaleza. Cada momento es único, con la luz y el clima transformando el paisaje ante mis ojos. Fotografiar cielos estrellados ofrece una conexión humilde con la inmensidad del universo, mezclando paciencia con asombro. Ya sean bosques brumosos o expansiones cósmicas, los paisajes me recuerdan la belleza y la grandeza del mundo. A través de mi lente, busco compartir estos momentos atemporales y asombrosos con los demás."
  },
  "cityscapephotopage": {
    "title": "Paisajes urbanos",
    "desc": "Como fotógrafo, me atrae la energía y la vitalidad de los paisajes urbanos, especialmente por la noche en Hong Kong. La ciudad se transforma después del anochecer, con letreros de neón y rascacielos brillantes pintando el horizonte con colores vivos. Capturar la interacción de la luz y la sombra en calles bulliciosas o reflejos en el puerto Victoria se siente como preservar el pulso de la ciudad. Cada toma cuenta una historia de movimiento, cultura y posibilidades infinitas. El contraste entre el resplandor urbano y los rincones tranquilos ofrece una perspectiva única de su belleza. A través de mi lente, busco compartir el atractivo dinámico de las noches de Hong Kong con los demás."
  },
  "weddingphotopage": {
    "title": "Boda",
    "desc": "Tu día de boda es una historia única, y mi objetivo es capturarlo de manera auténtica y hermosa. Me enfoco en momentos espontáneos y emociones genuinas mientras me aseguro de que cada detalle, desde la decoración hasta los pequeños gestos, esté cuidadosamente documentado. Mi estilo combina el fotoperiodismo natural con la narración creativa, influenciado por mi experiencia en el cine. Aquí hay un vistazo al amor y la alegría que llenan el día."
  },
  "applications": {
    "title": "Aplicaciones",
    "desc": "Soy un reciente graduado de Le Wagon con experiencia práctica en desarrollo web, donde construí aplicaciones desde cero utilizando Ruby on Rails, JavaScript y React. Durante el programa, desarrollé sólidas habilidades para resolver problemas y aprendí a trabajar con herramientas como Git, SQL e integraciones de API. De esta manera, obtuve una comprensión sólida tanto del desarrollo frontend como backend.",
    "github": "Mi cuenta de GitHub",
    "techstack": "Mi stack tecnológica"
  },
  "projects": {
    "sportify": {
      "title": "SPORTIFY",
      "desc": "Sportify es una PWA desarrollada con Ruby on Rails, PostgreSQL y Javascript con AJAX para conectar a los usuarios con socios deportivos al buscar o crear eventos locales. Lo diseñamos en Figma, utilizamos Bootstrap para la interfaz de usuario y lo implementamos en Heroku con un dominio personalizado. El proyecto fue presentado frente a una gran audiencia."
    },
    "gis": {
      "title": "PROYECTO GIS",
      "desc": "Este proyecto es una aplicación web GIS que permite a los usuarios visualizar e interactuar con datos geoespaciales. Fue construido utilizando React, Leaflet y Mapbox, e incluye características como capas de mapas, marcadores y ventanas emergentes. La aplicación está diseñada para ser fácil de usar y receptiva."
    },
    "carbonSavings": {
      "title": "CARBON SAVINGS SIMULATOR",
      "desc": "El Simulador de Ahorro de Carbono es una aplicación web que muestra lo que ahorras al andar en bicicleta en lugar de usar un coche o transporte público. Calcula las emisiones de carbono, el dinero ahorrado y las calorías quemadas, con visualizaciones gráficas para facilitar los análisis. Desarrollado con React, Tailwind CSS y la API de Mapbox, es fácil de usar y adaptable a cualquier dispositivo."
    },
    "portfolio": {
      "title": "PORTAFOLIO",
      "desc": "Este portafolio fue construido con React. Utilicé React Router para gestionar múltiples páginas y lo alojé en Github Pages. Las animaciones están hechas con Framer Motion. Finalmente implementé un Modo Oscuro para una interfaz más agradable, así como un sistema de gestión de idiomas. Muestra mis proyectos, habilidades y experiencias, con un diseño limpio y personal."
    },
    "tymouet": {
      "title": "TY MOUET",
      "desc": "Ty Mouet fue nuestro primer proyecto en Le Wagon, un clon de Airbnb con temática de gaviotas construido con Ruby on Rails, PostgreSQL y AJAX. Gestionamos una base de datos de muchos a muchos, lo implementamos en Heroku y trabajamos en un equipo ágil. Las características clave incluyeron lógica de reservas, autenticación de usuarios y búsqueda dinámica basada en geolocalización."
    },
    "movieWatchlist": {
      "title": "MOVIES WATCHLIST",
      "desc": "Movies Watchlist es una aplicación web React y Redux que permite a los usuarios descubrir y organizar sus películas favoritas utilizando la base de datos de TMDB. Las características incluyen búsqueda en tiempo real, navegación categorizada y una lista de reproducción personalizada donde los usuarios pueden calificar y comentar películas, con caché local para la persistencia de las selecciones."
    }
  },
  "books": {
    "title": "Libros",
    "description": "Creé dos libros que documentan cinco meses de aventura en el sudeste asiático, utilizando mis propias fotos y textos. Autoeditados y vendidos en más de 500 copias, esta experiencia me enseñó la consistencia en el diseño y cómo gestionar proyectos a gran escala.",
    "civilisation": {
      "title": "Civilisation",
      "description": "El primer libro que hice es Civilisation, narrando los detrás de escena de la película homónima, vista por más de 5000 personas. Civilisation es la aventura de 9 amigos que viajan al otro lado del mundo para filmar una película de parkour y aventura en el sudeste asiático. Síguelos a través de su viaje de filmación en tres países y entornos diferentes, donde enfrentaron una multitud de desafíos. Viaja con ellos a través de esta historia y sus impresionantes fotos. \n\n Este libro tiene 80 páginas y fue editado completamente por mí. \n\n ¡Haz clic en él para leer algunas páginas!"
    },
    "wizzy": {
      "title": "Wizzy en Asia",
      "description": "El segundo libro que hice es Wizzy en Asia, siguiendo el viaje de Civilisation. Wizzy en Asia es la aventura de 9 amigos que viajan al otro lado del mundo durante varios meses con el objetivo de practicar Parkour en los tejados de las megaciudades de Asia. Síguelos en su viaje mientras enfrentan una multitud de desafíos. Desde saltar por los enormes tejados de Bangkok hasta explorar una ciudad fantasma en Malasia e incluso quedar varados juntos en Hong Kong durante un mes, es una aventura llena de adrenalina. Experimenta su historia y sus impresionantes fotos mientras viajas con ellos. \n\n Este libro tiene 112 páginas y fue editado completamente por mí. \n\n ¡Haz clic en él para leer algunas páginas!"
    },
    "galleryphoto": "Ver la galería",
    "watchmovie": "Ver la película",
    "seegallery": "Ver galería"
  },
  "bookgallery": {
    "desc": "Aquí hay algunas páginas de la revista que escribí e ilustré."
  },
  "cardData": {
    "webDevelopment": {
      "title": "Desarrollo Web",
      "text": "El desarrollo web combina creatividad y resolución de problemas, inspirándose en mi experiencia en fotografía."
    },
    "photography": {
      "title": "Fotografía",
      "text": "Descubrir la fotografía conectó mis pasiones por el arte y la narración, permitiéndome capturar momentos únicos."
    },
    "design": {
      "title": "Diseño",
      "text": "Creé y vendí más de 500 copias de 2 libros sobre mi viaje en el sudeste asiático, con mis fotos y textos."
    }
  }
}
