{
  "navbar": {
    "home": "Accueil",
    "applications": "Applications",
    "photos": "Photos",
    "books": "Livres",
    "contact": "Contact",
    "wedding": "Mariage",
    "mosaic": "Mosaïque",
    "sport": "Sport",
    "cityscape": "Ville",
    "landscape": "Paysage",
    "civilisation": "Civilisation",
    "wizzyenasie": "Wizzy en Asie",
    "descriptions": {
      "wedding": "Découvrez mes photos de mariage",
      "mosaic": "Collection de photos en mosaïque",
      "sport": "Photos de sports et d'événements sportifs",
      "cityscape": "Paysages urbains et gratte-ciels",
      "landscape": "Paysages naturels et montagnes",
      "civilisation": "Mon livre sur le film Civilisation",
      "wizzyenasie": "Mon livre de mes aventures en Asie"
    }
  },
  "heroSection": {
    "title": "Félix Orain",
    "profession": "Développeur et photographe  ",
    "description": {
      "part1": "Développement web sur mesure et photographie professionnelle",
      "part2": " — des sites performants et des images qui captivent, réunis dans une approche créative unique pour valoriser votre présence digitale."
    },
    "buttons": {
      "browse": "Voir le portfolio",
      "contact": "Me contacter"
    }
  },
  "portfolio": {
    "title": "Mon portfolio",
    "intro": "Après quatre ans comme photographe freelance, je me suis lancé dans le développement web pour mêler ma vision artistique à la technologie et créer des expériences numériques uniques. \n Découvrez mes projets et voyez sur quoi j’ai travaillé !"
  },
  "about": {
    "title": "À propos",
    "desc": "Je suis un développeur web créatif avec une solide expérience en photographie et en design. Depuis des années, j’aime explorer différentes façons de donner vie aux idées à travers l’image et le récit, affinant mon œil pour le détail et l’esthétique. \n\n Aujourd’hui, je mets cette passion au service de la création d’expériences numériques intuitives et accessibles. J’élargis actuellement mes compétences en apprenant Ruby on Rails et React, désireux de combiner mon bagage créatif à de nouvelles expertises techniques pour concevoir des produits utiles et engageants.",
    "resume": "Mon CV"
  },
  "readMore": "En savoir plus",
  "seeMore": {
    "webdev": {
      "text": "Voir tous mes projets",
      "ariaLabel": "Voir tous les projets de développement web de Félix Orain"
    },
    "photography": {
      "text": "Voir toutes mes photos",
      "ariaLabel": "Voir toute la galerie photo de Félix Orain"
    },
    "books": {
      "text": "Voir mes publications",
      "ariaLabel": "Voir tous les livres et magazines de Félix Orain"
    }
  },
  "contact": {
    "title": "Contactez-moi",
    "text": "N'hésitez pas à me contacter pour tout projet à : felix.orain@gmail.com",
    "name": "Votre nom",
    "email": "Votre email",
    "message": "Votre message",
    "send": "Envoyer le message"
  },
  "notFound": {
    "title": "404 - Page non trouvée",
    "subtitle": "Vous vous êtes peut-être perdu, retournez à la page principale :",
    "back": "Retour à l'accueil"
  },
  "footer": {
    "copyright": "Copyright Felix Orain © Tous droits réservés.",
    "madeby": "Développé avec ❤️ par Félix Orain"
  },
  "webdev": {
    "title": "Développement web",
    "desc": "J'ai été diplômé du Wagon et j'ai créé des applications réelles de A à Z, acquérant une expérience concrète en développement web. Grâce à mon parcours en photographie, j'apporte un sens aigu du design, désormais allié à de solides compétences en programmation.",
    "sportify": "SPORTIFY",
    "tymouet": "TY MOUET",
    "portfolio": "PORTFOLIO"
  },
  "design": {
    "title": "Design",
    "desc": "J'ai créé deux livres retraçant cinq mois d'aventure en Asie du Sud-Est, en utilisant mes propres photos et textes. Auto-édités et vendus à plus de 500 exemplaires, cette expérience m'a appris la rigueur dans le design et la gestion de projets d'envergure."
  },
  "photographysection": {
    "title": "Photographie",
    "desc": "Depuis tout petit, j'ai toujours été fasciné par l'art et l'aventure. Je voulais répondre à ce besoin profond d'aventure et pouvoir raconter ces histoires à ma façon. Quand j'ai découvert la photographie il y a quelques années, un tout nouveau monde s'est ouvert à moi."
  },

  "photospage": {
    "title": "Photographie",
    "desc": "Depuis tout petit, j'ai toujours été fasciné par l'art et l'aventure. Je voulais répondre à ce besoin profond d'aventure et pouvoir raconter ces histoires à ma façon. Quand j'ai découvert la photographie il y a quelques années, un tout nouveau monde s'est ouvert à moi.",
    "sport": "Sport",
    "mosaic": "Mosaïque",
    "cityscape": "Ville",
    "landscape": "Paysage",
    "wedding": "Mariage"
  },
  "sportphotopage": {
    "title": "Sport",
    "desc": "Découvrir la photographie d'action m'a semblé être le moyen idéal de capturer le mouvement, l'émotion et la narration. Photographier le parkour, l'escalade ou les silhouettes dans de vastes environnements m'a permis de mettre en valeur à la fois le dynamisme humain et l'échelle du monde qui nous entoure. Chaque cliché figeait un moment d'énergie, où le mouvement rencontrait l'immobilité de la nature ou de l'architecture. Grâce à cela, j'ai appris à embrasser l'imprévisibilité du mouvement et le défi du timing, capturant non seulement l'action mais aussi l'histoire de l'effort, de la liberté et de notre connexion avec le monde. Ce style de photographie m'a appris à voir le mouvement et le sens dans la relation entre les humains et leur environnement."
  },
  "mosaicphotopage": {
    "title": "Mosaïque",
    "desc": "J'adore capturer les motifs en photographie car ils révèlent la beauté dans la simplicité et la répétition. Qu'ils soient trouvés dans la nature ou l'architecture, les motifs créent un rythme et une harmonie qui attirent le regard. Photographier ces détails—comme les ondulations de l'eau, les façades carrelées ou les ombres symétriques—c'est comme découvrir un art caché dans le quotidien. Les motifs racontent des histoires de design, de structure et d'équilibre, offrant un sentiment d'ordre dans un monde chaotique. À travers mon objectif, je cherche à célébrer ces visuels fascinants et à inviter les autres à voir le monde différemment."
  },
  "landscapephotopage": {
    "title": "Paysages",
    "desc": "En tant que photographe, j'aime les paysages pour leur capacité à évoquer à la fois le calme et l'émerveillement. Capturer les nuages dérivant à travers les falaises et vallées de Yosemite, c'est comme préserver les chefs-d'œuvre éphémères de la nature. Chaque moment est unique, avec la lumière et le climat transformant le paysage sous mes yeux. Photographier les cieux étoilés offre une connexion humble à l'immensité de l'univers, mêlant patience et émerveillement. Qu'il s'agisse de forêts embrumées ou d'étendues cosmiques, les paysages me rappellent la beauté et la grandeur du monde. À travers mon objectif, je vise à partager ces moments intemporels et époustouflants avec les autres."
  },
  "cityscapephotopage": {
    "title": "Ville",
    "desc": "En tant que photographe, je suis attiré par l'énergie et la vitalité des paysages urbains, surtout la nuit à Hong Kong. La ville se transforme après la tombée de la nuit, avec des enseignes au néon et des gratte-ciels scintillants peignant la ligne d'horizon de couleurs vives. Capturer le jeu de lumière et d'ombre dans les rues animées ou les reflets sur le port Victoria, c'est comme préserver le pouls de la ville. Chaque cliché raconte une histoire de mouvement, de culture et de possibilités infinies. Le contraste entre la lueur urbaine et les coins tranquilles offre une perspective unique sur sa beauté. À travers mon objectif, je cherche à partager l'attrait dynamique des nuits de Hong Kong avec les autres."
  },
  "weddingphotopage": {
    "title": "Mariage",
    "desc": "Votre jour de mariage est une histoire unique, et mon objectif est de la capturer de manière authentique et magnifique. Je me concentre sur les moments spontanés et les émotions sincères tout en m’assurant que chaque détail, du décor aux petits gestes, soit soigneusement immortalisé. Mon style allie le photojournalisme naturel à une narration créative, influencée par mon expérience dans le cinéma. Voici un aperçu de l’amour et de la joie qui remplissent cette journée."
  },

  "applications": {
    "title": "Applications",
    "desc": "Je suis diplômé du Wagon avec une expérience concrète en développement web, où j'ai créé des applications de A à Z avec Ruby on Rails, JavaScript et React. Durant la formation, j'ai développé de solides compétences en résolution de problèmes et appris à utiliser des outils comme Git, SQL et les intégrations d'API. J'ai ainsi acquis une bonne compréhension du développement frontend et backend.",
    "github": "Mon compte GitHub",
    "techstack": "Ma stack technique"
  },
  "projects": {
    "sportify": {
      "title": "SPORTIFY",
      "desc": "Sportify est une PWA développée avec Ruby on Rails, PostgreSQL et Javascript avec AJAX pour connecter des sportifs en créant ou rejoignant des événements locaux. Design sur Figma, UI avec Bootstrap, déploiement sur Heroku avec domaine personnalisé. Projet présenté devant un large public."
    },
    "gis": {
      "title": "PROJET SIG",
      "desc": "Ce projet est une application web SIG permettant de visualiser et d'interagir avec des données géospatiales. Réalisée avec React, Leaflet et Mapbox, elle propose des couches cartographiques, marqueurs et popups. L'application est conçue pour être intuitive et responsive."
    },
    "carbonSavings": {
      "title": "CARBON SAVINGS SIMULATOR",
      "desc": "Le Simulateur d’Économies de Carbone est une application web qui montre ce que vous économisez en faisant du vélo plutôt qu’en utilisant une voiture ou les transports en commun. Elle calcule les émissions de carbone, l’argent économisé et les calories brûlées, avec des visualisations graphiques pour des analyses claires. Développée avec React, Tailwind CSS et l’API Mapbox, elle est conviviale et réactive."
    },
    "portfolio": {
      "title": "PORTFOLIO",
      "desc": "Ce portfolio a été réalisé avec React. J'ai utilisé React Router pour gérer plusieurs pages et l'ai hébergé sur Github Pages. Les animations sont faites avec Framer Motion. J'ai finalement implémenté un Dark Mode pour une UI plus agréable ainsi qu'un système de gestion des langues. Il met en avant mes projets, compétences et expériences, avec un design épuré et personnel."
    },
    "tymouet": {
      "title": "TY MOUET",
      "desc": "Ty Mouet était notre premier projet au Wagon, un clone d'Airbnb sur le thème des mouettes, développé avec Ruby on Rails, PostgreSQL et AJAX. Gestion d'une base de données complexe, déploiement sur Heroku, travail en équipe agile. Fonctionnalités : réservation, authentification, recherche géolocalisée."
    },
    "movieWatchlist": {
      "title": "MOVIES WATCHLIST",
      "desc": "Movies Watchlist est une application web React et Redux qui permet aux utilisateurs de découvrir et d'organiser leurs films préférés grâce à la base de données de TMDB. Les fonctionnalités incluent une recherche en temps réel, un parcours de navigation catégorisé et une liste de lecture personnelle où les utilisateurs peuvent noter et commenter les films, avec un cache local pour la persistance des sélections."
    }
  },
  "books": {
    "title": "Livres",
    "description": "J'ai créé deux livres retraçant cinq mois d'aventure en Asie du Sud-Est, en utilisant mes propres photos et textes. Auto-édités et vendus à plus de 500 exemplaires, cette expérience m'a appris la rigueur dans le design et la gestion de projets d'envergure.",
    "civilisation": {
      "title": "Civilisation",
      "description": "Le premier livre que j’ai créé s’intitule Civilisation, et raconte les coulisses du film éponyme, vu par plus de 5000 spectateurs. Civilisation retrace l’aventure de 9 amis qui traversent le monde pour tourner un film mêlant parkour et aventure en Asie du Sud-Est. Suivez-les tout au long de leur périple à travers trois pays et environnements différents, où ils ont affronté de nombreux défis. Voyagez avec eux à travers cette histoire et découvrez leurs photos à couper le souffle. \n\n Ce livre de 80 pages a été entièrement édité par mes soins. \n\n Cliquez dessus pour lire quelques pages!"
    },
    "wizzy": {
      "title": "Wizzy en Asie",
      "description": "Le deuxième livre que j’ai créé s’intitule Wizzy en Asie, dans la continuité de Civilisation. Wizzy en Asie raconte l’aventure de 9 amis qui partent à l’autre bout du monde pendant plusieurs mois avec pour objectif de pratiquer le Parkour sur les toits des mégapoles asiatiques. Suivez-les dans leur périple alors qu’ils affrontent une multitude de défis. Du saut sur les immenses toits de Bangkok à l’exploration d’une ville fantôme en Malaisie, en passant par un mois bloqués ensemble à Hong Kong, c’est une aventure pleine d’adrénaline. Vivez leur histoire et découvrez leurs photos à couper le souffle en les accompagnant dans leur voyage. \n\n Ce livre de 112 pages a été entièrement édité par mes soins. \n\n Cliquez dessus pour lire quelques pages!"
    },
    "galleryphoto": "Voir le livre",
    "watchmovie": "Voir le film",
    "seegallery": "Voir galerie"
  },
  "bookgallery": {
    "desc": "Voici quelques pages du magazine que j'ai écrit et illustré."
  },
  "cardData": {
    "webDevelopment": {
      "title": "Développement Web",
      "text": "Le développement web allie créativité et résolution de problèmes, s'inspirant de mon expérience en photographie."
    },
    "photography": {
      "title": "Photographie",
      "text": "Découvrir la photographie a relié mes passions pour l'art et la narration, me permettant de capturer des moments uniques."
    },
    "design": {
      "title": "Design",
      "text": "J’ai créé et vendu plus de 500 exemplaires de 2 livres sur mon voyage en Asie du Sud-Est, avec mes photos et textes."
    }
  }
}
