{
  "applications": {
    "title": "Aplicaciones",
    "desc": "Desarrollador FullStack, creo aplicaciones web de alto rendimiento con Next.js, React y Tailwind CSS en el frontend, complementado con Ruby on Rails e integraciones API en el backend. Esta doble experiencia me permite ofrecer soluciones web completas, desde el diseño responsivo hasta la arquitectura técnica. Me comprometo a producir interfaces elegantes e intuitivas al tiempo que garantizo la robustez y la escalabilidad, para proyectos que combinan el rendimiento, la experiencia del usuario y la solidez técnica.",
    "github": "Mi cuenta de GitHub",
    "techstack": "Mi stack tecnológica"
  },
  "projects": {
    "actions": {
      "code": "Código",
      "preview": "Vista previa",
      "demo": "Demo"
    },
    "lifoAI": {
      "title": "LIFO.AI",
      "desc": "Contribuí a la startup LIFO.AI como desarrollador frontend, construyendo una plataforma de gestión de inventarios impulsada por IA con Next.js, TypeScript y Tailwind CSS. La aplicación aprovecha algoritmos de aprendizaje automático para optimizar los niveles de stock, predecir la demanda y automatizar las decisiones de compra. Desarrollé componentes de interfaz de usuario responsivos que transforman los análisis en ideas comerciales procesables."
    },
    "sportify": {
      "title": "SPORTIFY",
      "desc": "Sportify es una PWA desarrollada con Ruby on Rails, PostgreSQL y Javascript con AJAX para conectar a los usuarios con socios deportivos al buscar o crear eventos locales. Lo diseñamos en Figma, utilizamos Bootstrap para la interfaz de usuario y lo implementamos en Heroku con un dominio personalizado. El proyecto fue presentado frente a una gran audiencia."
    },
    "gis": {
      "title": "PROYECTO GIS",
      "desc": "Este proyecto es una aplicación web GIS que permite a los usuarios visualizar e interactuar con datos geoespaciales. Fue construido utilizando React, Leaflet y Mapbox, e incluye características como capas de mapas, marcadores y ventanas emergentes. La aplicación está diseñada para ser fácil de usar y responsiva."
    },
    "carbonSavings": {
      "title": "CARBON SAVINGS SIMULATOR",
      "desc": "El Simulador de Ahorro de Carbono es una aplicación web que muestra lo que ahorras al andar en bicicleta en lugar de usar un coche o transporte público. Calcula las emisiones de carbono, el dinero ahorrado y las calorías quemadas, con visualizaciones gráficas para facilitar los análisis. Desarrollado con React, Tailwind CSS y la API de Mapbox, es fácil de usar y adaptable a cualquier dispositivo."
    },
    "portfolio": {
      "title": "PORTAFOLIO",
      "desc": "Este portafolio fue desarrollado con Next.js, TypeScript y Tailwind. Integra un modo oscuro, next Intl para soporte multilingüe, animaciones con Framer Motion, optimización SEO avanzada y desplegado en Vercel. Muestra mis proyectos y servicios en una interfaz moderna y responsiva con un rendimiento óptimo."
    },
    "tymouet": {
      "title": "TY MOUET",
      "desc": "Ty Mouet fue nuestro primer proyecto en Le Wagon, un clon de Airbnb con temática de gaviotas construido con Ruby on Rails, PostgreSQL y AJAX. Gestionamos una base de datos de muchos a muchos, lo implementamos en Heroku y trabajamos en un equipo ágil. Las características clave incluyeron lógica de reservas, autenticación de usuarios y búsqueda dinámica basada en geolocalización."
    },
    "movieWatchlist": {
      "title": "MOVIES WATCHLIST",
      "desc": "Movies Watchlist es una aplicación web React y Redux que permite a los usuarios descubrir y organizar sus películas favoritas utilizando la base de datos de TMDB. Las características incluyen búsqueda en tiempo real, navegación categorizada y una lista de reproducción personalizada donde los usuarios pueden calificar y comentar películas, con caché local para la persistencia de las selecciones."
    }
  }
}
