{
  "applications": {
    "title": "Applications",
    "desc": "Développeur web spécialisé en React, Next.js et TypeScript, je conçois des applications performantes et centrées utilisateur. De l'architecture technique au design d'interfaces, je maîtrise l'ensemble du cycle de développement front-end. Mon approche allie rigueur technique, optimisation des performances et attention aux détails UX. Formé en fullstack (Ruby on Rails, PostgreSQL), je comprends les enjeux back-end et collabore efficacement avec les équipes techniques pour livrer des solutions web complètes et évolutives.",
    "github": "Mon compte GitHub",
    "techstack": "Ma stack technique"
  },
  "projects": {
    "actions": {
      "code": "Code",
      "preview": "Aperçu",
      "demo": "Démo"
    },
    "lifoAI": {
      "title": "LIFO.AI",
      "desc": "Développeur frontend chez Lifo.AI, startup spécialisée dans la gestion de stocks propulsée par l'IA. Conception et développement de l'application avec Next.js, TypeScript et Tailwind CSS : pages marketing, dashboard avec filtres avancés et scan OCR, système multilingue, optimisation des performances. Mise en place de l'infrastructure technique (tests Jest, analytics, RGPD) et assurance qualité complète. L'application utilise des algorithmes de machine learning pour optimiser les niveaux de stock, prévoir la demande et automatiser les décisions d'approvisionnement."
    },
    "sportify": {
      "title": "SPORTIFY",
      "desc": "Sportify est une PWA développée avec Ruby on Rails, PostgreSQL et Javascript avec AJAX pour connecter des sportifs en créant ou rejoignant des événements locaux. Design sur Figma, UI avec Bootstrap, déploiement sur Heroku avec domaine personnalisé. Projet présenté devant un large public."
    },
    "gis": {
      "title": "PROJET SIG",
      "desc": "Ce projet est une application web SIG permettant de visualiser et d'interagir avec des données géospatiales. Réalisée avec React, Leaflet et Mapbox, elle propose des couches cartographiques, marqueurs et popups. L'application est conçue pour être intuitive et responsive."
    },
    "carbonSavings": {
      "title": "CARBON SAVINGS SIMULATOR",
      "desc": "Le Simulateur d'Économies de Carbone est une application web qui montre ce que vous économisez en faisant du vélo plutôt qu'en utilisant une voiture ou les transports en commun. Elle calcule les émissions de carbone, l'argent économisé et les calories brûlées, avec des visualisations graphiques pour des analyses claires. Développée avec React, Tailwind CSS et l'API Mapbox, elle est conviviale et réactive."
    },
    "portfolio": {
      "title": "PORTFOLIO",
      "desc": "Portfolio développé avec Next.js, TypeScript et Tailwind. Intègre Next-intl pour le multilinguisme, le dark mode, des animations avec Framer Motion, une optimisation SEO avancée et un déploiement sur Vercel. Présente mes projets et services dans une interface moderne et responsive avec des performances optimales."
    },
    "tymouet": {
      "title": "TY MOUET",
      "desc": "Ty Mouet était notre premier projet au Wagon, un clone d'Airbnb sur le thème des mouettes, développé avec Ruby on Rails, PostgreSQL et AJAX. Gestion d'une base de données complexe, déploiement sur Heroku, travail en équipe agile. Fonctionnalités : réservation, authentification, recherche géolocalisée."
    },
    "movieWatchlist": {
      "title": "MOVIES WATCHLIST",
      "desc": "Movies Watchlist est une application web React et Redux qui permet aux utilisateurs de découvrir et d'organiser leurs films préférés grâce à la base de données de TMDB. Les fonctionnalités incluent une recherche en temps réel, un parcours de navigation catégorisé et une liste de lecture personnelle où les utilisateurs peuvent noter et commenter les films, avec un cache local pour la persistance des sélections."
    }
  }
}
