{
  "heroSection": {
    "title": "Félix Orain",
    "profession": "Développeur et photographe  ",
    "description": {
      "part1": "Développement web sur mesure et photographie professionnelle",
      "part2": " — des sites performants et des images qui captivent, réunis dans une approche créative unique pour valoriser votre présence digitale."
    },
    "buttons": {
      "browse": "Voir le portfolio",
      "contact": "Me contacter"
    }
  },
  "portfolio": {
    "title": "Web, Photographie & Design",
    "intro": "Concrétisez vos ambitions digitales avec une approche où chaque détail compte.",
    "subIntro": "Explorez chaque domaine et découvrez comment mon approche peut répondre à vos besoins."
  },
  "cardData": {
    "webDevelopment": {
      "title": "Développement Web",
      "text": "Le développement web allie créativité et résolution de problèmes, s'inspirant de mon expérience en photographie.",
      "buttonText": "Voir applications"
    },
    "photography": {
      "title": "Photographie",
      "text": "Découvrir la photographie a relié mes passions pour l'art et la narration, me permettant de capturer des moments uniques.",
      "buttonText": "Voir photos"
    },
    "design": {
      "title": "Design",
      "text": "J'ai créé et vendu plus de 500 exemplaires de 2 livres sur mon voyage en Asie du Sud-Est, avec mes photos et textes.",
      "buttonText": "Voir livres"
    }
  },
  "webdevsection": {
    "title": "Développement Web",
    "desc": "Spécialiste des technologies modernes, je développe des sites et applications performants avec Next.js, React et Tailwind CSS. Mon expertise s'étend du responsive design à l'optimisation SEO, en passant par les animations fluides et les interfaces utilisateur intuitives.",
    "desc2": "Je construis des solutions web évolutives qui s'adaptent parfaitement à tous les appareils, avec une attention particulière portée à l'accessibilité et aux performances. Chaque projet bénéficie des meilleures pratiques du développement front-end moderne."
  },
  "photographysection": {
    "title": "Photographie",
    "desc": "La photographie est pour moi l'art de saisir l'émotion et de raconter une histoire. Spécialisé en sport, portraits, mariages, paysages et architecture, je capture des instants authentiques avec une approche alliant technique et sensibilité artistique, pour des images naturelles et intemporelles."
  },
  "designsection": {
    "title": "Design",
    "desc": "J'ai créé deux livres retraçant cinq mois d'aventure en Asie du Sud-Est, en utilisant mes propres photos et textes. Auto-édités et vendus à plus de 500 exemplaires, cette expérience m'a appris la rigueur dans le design et la gestion de projets d'envergure."
  },
  "about": {
    "title": "À propos",
    "desc": "Développeur web créatif et photographe professionnel, j'allie expertise technique et sensibilité artistique dans une approche unique. Mon parcours m'a doté d'un œil attentif aux détails que j'applique tant au code qu'à l'image. En tant que freelance, je m'adapte aux besoins spécifiques de chaque projet, combinant performance technique et impact visuel pour des résultats qui dépassent les attentes.\n\nCôté développement, je maîtrise les technologies modernes pour créer des interfaces à la fois élégantes et performantes. Ma double expertise me permet d'offrir des solutions web complètes où chaque élément est pensé avec rigueur. En photographie, je capture l'essence de différents univers : paysages urbains, sports, événements et mariages. Cette pratique enrichit constamment ma créativité et influence mon approche du design web.",
    "resume": "Mon CV"
  },
  "readMore": "En savoir plus",
  "seeMore": {
    "webdev": {
      "text": "Voir tous mes projets",
      "ariaLabel": "Voir tous les projets de développement web de Félix Orain"
    },
    "photography": {
      "text": "Voir toutes mes photos",
      "ariaLabel": "Voir toute la galerie photo de Félix Orain"
    },
    "books": {
      "text": "Voir mes publications",
      "ariaLabel": "Voir tous les livres et magazines de Félix Orain"
    }
  }
}
